### Sort and Rank Functions

In [8]:
import pandas as pd

In [9]:
Cardata = { "Mercedes": [2, 4, 0, 4, 0, 3], "Ford": [3, 0, 0, 1, 6, 12], "Tata":[9, 3, 4, 1, 0, 0], "Renault":[12, 1, 0, 0, 3, 1]}
Carsales = pd.DataFrame(Cardata)
Carsales.index.rename("Sales place", inplace=True)
Carsales.rename(index={0: "One", 1: "Two", 2: "Three", 3: "Four", 4: "Five", 5: "Six"}, inplace=True)
Carsales

             Mercedes  Ford  Tata  Renault
Sales place
One                 2     3     9       12
Two                 4     0     3        1
Three               0     0     4        0
Four                4     1     1        0
Five                0     6     0        3
Six                 3    12     0        1

In [4]:
#Sort the DataFrame using the sort_vales() function
print(Carsales.sort_values(by="Ford", ascending=True))

             Mercedes  Ford  Tata  Renault
Sales place
Two                 4     0     3        1
Three               0     0     4        0
Four                4     1     1        0
One                 2     3     9       12
Five                0     6     0        3
Six                 3    12     0        1

In [5]:
#Sort the DataFrame using the sort_vales() function descending order
print(Carsales.sort_values(by="Ford", ascending=False))

             Mercedes  Ford  Tata  Renault
Sales place
Six                 3    12     0        1
Five                0     6     0        3
One                 2     3     9       12
Four                4     1     1        0
Two                 4     0     3        1
Three               0     0     4        0

#### Sort by multiple columns

In [10]:
print(Carsales.sort_values(by=["Ford", "Tata"],ascending=False))

             Mercedes  Ford  Tata  Renault
Sales place
Six                 3    12     0        1
Five                0     6     0        3
One                 2     3     9       12
Four                4     1     1        0
Three               0     0     4        0
Two                 4     0     3        1

In [11]:
print(Carsales.sort_values(by=["Ford", "Tata"],ascending=[False,True]))

             Mercedes  Ford  Tata  Renault
Sales place
Six                 3    12     0        1
Five                0     6     0        3
One                 2     3     9       12
Four                4     1     1        0
Two                 4     0     3        1
Three               0     0     4        0

In [14]:
print(Carsales.sort_index())

             Mercedes  Ford  Tata  Renault
Sales place
Five                0     6     0        3
Four                4     1     1        0
One                 2     3     9       12
Six                 3    12     0        1
Three               0     0     4        0
Two                 4     0     3        1

### Find max value for every column using idexmax() function

In [19]:
print(Carsales.idxmax())

Mercedes    Two
Ford        Six
Tata        One
Renault     One
dtype: object

In [20]:
print(Carsales.idxmax(axis=1))

Sales place
One       Renault
Two      Mercedes
Three        Tata
Four     Mercedes
Five         Ford
Six          Ford
dtype: object

### rows value or sales places having minimum value

In [21]:
print(Carsales.idxmin())

Mercedes    Three
Ford          Two
Tata         Five
Renault     Three
dtype: object

In [23]:
print(Carsales.idxmin(axis="columns"))

Sales place
One      Mercedes
Two          Ford
Three    Mercedes
Four      Renault
Five     Mercedes
Six          Tata
dtype: object

In [25]:
Carsales.iloc[::2,:]

             Mercedes  Ford  Tata  Renault
Sales place
One                 2     3     9       12
Three               0     0     4        0
Five                0     6     0        3

In [29]:
#Find the Top 3 highest values for Mercedes and keep duplicates
print(Carsales.nlargest(3,columns="Mercedes",keep="all"))

             Mercedes  Ford  Tata  Renault
Sales place
Two                 4     0     3        1
Four                4     1     1        0
Six                 3    12     0        1

In [30]:
#Find the Top 3 highest values for Mercedes and keep duplicates
print(Carsales.nsmallest(3,columns="Mercedes",keep="all"))

             Mercedes  Ford  Tata  Renault
Sales place
Three               0     0     4        0
Five                0     6     0        3
One                 2     3     9       12